Revit 2027 API
IFCGeometryInfo.CreateSurfaceGeometryInfo Method
 Creates a new container object which holds IfcSurface handles processed from a Revit geometry object.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IFCGeometryInfo CreateSurfaceGeometryInfo(
	double epsilon
)
Public Shared Function CreateSurfaceGeometryInfo (
	epsilon As Double
) As IFCGeometryInfo
public:
static IFCGeometryInfo^ CreateSurfaceGeometryInfo(
	double epsilon
)
static member CreateSurfaceGeometryInfo :
        epsilon : float -> IFCGeometryInfo
Parameters
epsilon Double
 The epsilon value used to process surfaces.
Return Value
IFCGeometryInfo
 The new geometry info container.
See Also
Reference
IFCGeometryInfo Class
Autodesk.Revit.DB.IFC Namespace